from exEuclidExp import exEuclidExp

p1 = 179769313486231590770839156793787453197860296048756011706444423684197180216158519368947833795864925541502180565485980503646440548199239100050792877003355816639229553136239076508735759914822574862575007425302077447712589550957937778424442426617334727629299387668709205606050270810842907692932019128194467627007
g1 = 2
g2 = 3
g3 = p1-4


def main():
    # g_1^-1 (mod p1) に関して、計算量R(n)と繰り返し回数を求める
    result1 = exEuclidExp(p1, g1)
    # 計算量R(n)
    R_p1 = len(bin(p1))-2
    # 繰り返し回数
    counter1 = result1[3]

    # g_3^-1 (mod p1) に関して、計算量R(n)と繰り返し回数を求める
    result2 = exEuclidExp(p1, g3)
    # 計算量R(n)は同じ
    # 繰り返し回数
    counter2 = result2[3]

    eva1 = R_p1*counter1
    eva2 = R_p1*counter2

    print(f'（1）の計算量 = {eva1}')
    print(f'（2）の計算量 = {eva2}')

    return 0


if __name__ == '__main__':
    main()
